# Groupby

Groupby is a pretty simple concept. We can create a grouping of categories and apply a function to the categories. It’s a simple concept but it’s an extremely valuable technique that’s widely used in data science. In real data science projects, you’ll be dealing with large amounts of data and trying things over and over, so for efficiency, we use Groupby concept. Groupby concept is really important because it’s ability to aggregate data efficiently, both in performance and the amount code is magnificent.

Any groupby operation involves one of the following operations on the original object. They are −

Splitting the Object

Applying a function

Combining the results

In many situations, we split the data into sets and we apply some functionality on each subset. In the apply functionality, we can perform the following operations −

Aggregation − computing a summary statistic

Transformation − perform some group-specific operation

Filtration − discarding the data with some condition

In [56]:
#Splitting or Aggregations or Fiteration or Transformation
import pandas as pd

ipl_data = {'Team': ['MI', 'MI', 'Devils', 'Devils', 'Kings',
   'CSK', 'CSK', 'CSK', 'MI', 'Royals', 'Royals', 'MI'],
   'Rank': [1, 2, 2, 3, 3,4 ,1 ,1,2 , 4,1,2],
   'Year': [2014,2015,2014,2015,2014,2015,2016,2017,2016,2014,2015,2017],
   'Points':[876,789,863,673,741,812,756,788,694,701,804,690]}
df = pd.DataFrame(ipl_data)
df

      Team  Rank  Year  Points
0       MI     1  2014     876
1       MI     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5      CSK     4  2015     812
6      CSK     1  2016     756
7      CSK     1  2017     788
8       MI     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11      MI     2  2017     690

In [57]:
#i want the unique Team Names/find out total teams in dataset
df['Team'].unique()

array(['MI', 'Devils', 'Kings', 'CSK', 'Royals'], dtype=object)

In [58]:
df['Team'].value_counts()

MI        4
CSK       3
Royals    2
Devils    2
Kings     1
Name: Team, dtype: int64

In [59]:
df.groupby('Team') #groupby on Team column

In [60]:
df.groupby('Team').groups#it gives team name : index(where it is present)

{'CSK': [5, 6, 7], 'Devils': [2, 3], 'Kings': [4], 'MI': [0, 1, 8, 11], 'Royals': [9, 10]}

In [61]:
list(df.groupby('Team'))

[('CSK',
    Team  Rank  Year  Points
  5  CSK     4  2015     812
  6  CSK     1  2016     756
  7  CSK     1  2017     788),
 ('Devils',
       Team  Rank  Year  Points
  2  Devils     2  2014     863
  3  Devils     3  2015     673),
 ('Kings',
      Team  Rank  Year  Points
  4  Kings     3  2014     741),
 ('MI',
     Team  Rank  Year  Points
  0    MI     1  2014     876
  1    MI     2  2015     789
  8    MI     2  2016     694
  11   MI     2  2017     690),
 ('Royals',
        Team  Rank  Year  Points
  9   Royals     4  2014     701
  10  Royals     1  2015     804)]

In [62]:
for i in df.groupby('Team'):
    print(i)

('CSK',   Team  Rank  Year  Points
5  CSK     4  2015     812
6  CSK     1  2016     756
7  CSK     1  2017     788)
('Devils',      Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673)
('Kings',     Team  Rank  Year  Points
4  Kings     3  2014     741)
('MI',    Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690)
('Royals',       Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804)

In [63]:
for i in df.groupby('Team'):
    print(i)
    print('\n')# it will give space between record of two teams.

('CSK',   Team  Rank  Year  Points
5  CSK     4  2015     812
6  CSK     1  2016     756
7  CSK     1  2017     788)


('Devils',      Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673)


('Kings',     Team  Rank  Year  Points
4  Kings     3  2014     741)


('MI',    Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690)


('Royals',       Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804)

In [64]:
#if i want only team from a tuple
for i in df.groupby('Team'):
    print(i[0])
    print('\n')

CSK


Devils


Kings


MI


Royals

In [65]:
#if i want only dataFrame of team from a tuple
for i in df.groupby('Team'):
    print(i[0])
    print('\n')

CSK


Devils


Kings


MI


Royals

In [66]:
#if i want only team and adata from a tuple
for team,Data in df.groupby('Team'):
    print(Data)
    print('\n')

  Team  Rank  Year  Points
5  CSK     4  2015     812
6  CSK     1  2016     756
7  CSK     1  2017     788


     Team  Rank  Year  Points
2  Devils     2  2014     863
3  Devils     3  2015     673


    Team  Rank  Year  Points
4  Kings     3  2014     741


   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690


      Team  Rank  Year  Points
9   Royals     4  2014     701
10  Royals     1  2015     804

In [67]:
#fetch data of only MI
for team,data in df.groupby('Team'):
    if team=='MI':
        print(data)

   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690

In [68]:
df.groupby('Team').get_group("MI")

   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690

In [69]:
df

      Team  Rank  Year  Points
0       MI     1  2014     876
1       MI     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5      CSK     4  2015     812
6      CSK     1  2016     756
7      CSK     1  2017     788
8       MI     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11      MI     2  2017     690

In [70]:
df.groupby('Team').mean()

        Rank    Year      Points
Team
CSK     2.00  2016.0  785.333333
Devils  2.50  2014.5  768.000000
Kings   3.00  2014.0  741.000000
MI      1.75  2015.5  762.250000
Royals  2.50  2014.5  752.500000

In [71]:
df.groupby('Team').mean()['Points']

Team
CSK       785.333333
Devils    768.000000
Kings     741.000000
MI        762.250000
Royals    752.500000
Name: Points, dtype: float64

In [72]:
df.groupby('Team').mean()['Rank']

Team
CSK       2.00
Devils    2.50
Kings     3.00
MI        1.75
Royals    2.50
Name: Rank, dtype: float64

In [73]:
#take sum of all points yearwise
df.groupby('Team').sum()['Points']

Team
CSK       2356
Devils    1536
Kings      741
MI        3049
Royals    1505
Name: Points, dtype: int64

In [74]:
df.groupby('Rank').groups #Total teams 5

{1: [0, 6, 7, 10], 2: [1, 2, 8, 11], 3: [3, 4], 4: [5, 9]}

In [75]:
list(df.groupby('Rank'))

[(1,
        Team  Rank  Year  Points
  0       MI     1  2014     876
  6      CSK     1  2016     756
  7      CSK     1  2017     788
  10  Royals     1  2015     804),
 (2,
        Team  Rank  Year  Points
  1       MI     2  2015     789
  2   Devils     2  2014     863
  8       MI     2  2016     694
  11      MI     2  2017     690),
 (3,
       Team  Rank  Year  Points
  3  Devils     3  2015     673
  4   Kings     3  2014     741),
 (4,
       Team  Rank  Year  Points
  5     CSK     4  2015     812
  9  Royals     4  2014     701)]

In [76]:
#fetch only teams with rank 1
df.groupby('Rank').get_group(1)

      Team  Rank  Year  Points
0       MI     1  2014     876
6      CSK     1  2016     756
7      CSK     1  2017     788
10  Royals     1  2015     804

In [77]:
df.groupby('Rank').first(3) #last()

      Year  Points
Rank
1     2014     876
2     2015     789
3     2015     673
4     2015     812

In [78]:
df.groupby('Rank').first() #last()

        Team  Year  Points
Rank
1         MI  2014     876
2         MI  2015     789
3     Devils  2015     673
4        CSK  2015     812

In [79]:
df.groupby('Rank').last()

        Team  Year  Points
Rank
1     Royals  2015     804
2         MI  2017     690
3      Kings  2014     741
4     Royals  2014     701

In [80]:
#Multiple column groupby
df.groupby(['Team','Year']).groups

{('CSK', 2015): [5], ('CSK', 2016): [6], ('CSK', 2017): [7], ('Devils', 2014): [2], ('Devils', 2015): [3], ('Kings', 2014): [4], ('MI', 2014): [0], ('MI', 2015): [1], ('MI', 2016): [8], ('MI', 2017): [11], ('Royals', 2014): [9], ('Royals', 2015): [10]}

# Iterations over Group

In [81]:
#Iterating through groups
#Problem statement: Identify yearwise records  from whole dataset
list(df.groupby('Year'))

[(2014,
       Team  Rank  Year  Points
  0      MI     1  2014     876
  2  Devils     2  2014     863
  4   Kings     3  2014     741
  9  Royals     4  2014     701),
 (2015,
        Team  Rank  Year  Points
  1       MI     2  2015     789
  3   Devils     3  2015     673
  5      CSK     4  2015     812
  10  Royals     1  2015     804),
 (2016,
    Team  Rank  Year  Points
  6  CSK     1  2016     756
  8   MI     2  2016     694),
 (2017,
     Team  Rank  Year  Points
  7   CSK     1  2017     788
  11   MI     2  2017     690)]

In [82]:
g1=df.groupby('Year')
for s in g1:
    print(s)

(2014,      Team  Rank  Year  Points
0      MI     1  2014     876
2  Devils     2  2014     863
4   Kings     3  2014     741
9  Royals     4  2014     701)
(2015,       Team  Rank  Year  Points
1       MI     2  2015     789
3   Devils     3  2015     673
5      CSK     4  2015     812
10  Royals     1  2015     804)
(2016,   Team  Rank  Year  Points
6  CSK     1  2016     756
8   MI     2  2016     694)
(2017,    Team  Rank  Year  Points
7   CSK     1  2017     788
11   MI     2  2017     690)

In [83]:
grouped = df.groupby('Year')
for v in grouped:
    print(v[0])

2014
2015
2016
2017

In [84]:
grouped = df.groupby('Year')
for v in grouped:
    if v[0]==2015:
        print(v[1])

      Team  Rank  Year  Points
1       MI     2  2015     789
3   Devils     3  2015     673
5      CSK     4  2015     812
10  Royals     1  2015     804

In [85]:
g1=df.groupby('Year')
list(g1)

[(2014,
       Team  Rank  Year  Points
  0      MI     1  2014     876
  2  Devils     2  2014     863
  4   Kings     3  2014     741
  9  Royals     4  2014     701),
 (2015,
        Team  Rank  Year  Points
  1       MI     2  2015     789
  3   Devils     3  2015     673
  5      CSK     4  2015     812
  10  Royals     1  2015     804),
 (2016,
    Team  Rank  Year  Points
  6  CSK     1  2016     756
  8   MI     2  2016     694),
 (2017,
     Team  Rank  Year  Points
  7   CSK     1  2017     788
  11   MI     2  2017     690)]

In [86]:
g1=df.groupby('Year')
list(g1)[1:2][0][1][1:3]

     Team  Rank  Year  Points
3  Devils     3  2015     673
5     CSK     4  2015     812

In [115]:
g1=df.groupby('Year')
list(g1)[1:2][0]

(2015,
       Team  Rank  Year  Points
 1       MI     2  2015     789
 3   Devils     3  2015     673
 5      CSK     4  2015     812
 10  Royals     1  2015     804)

In [121]:
g1=df.groupby('Year')
list(g1)[1][1][1:3]

     Team  Rank  Year  Points
3  Devils     3  2015     673
5     CSK     4  2015     812

In [114]:
g1=df.groupby('Year')
list(g1)[1:2][0][1:3]

(      Team  Rank  Year  Points
 1       MI     2  2015     789
 3   Devils     3  2015     673
 5      CSK     4  2015     812
 10  Royals     1  2015     804,)

In [89]:
#fetch record of 2015 without using groupby
df[df['Year']==2015]

      Team  Rank  Year  Points
1       MI     2  2015     789
3   Devils     3  2015     673
5      CSK     4  2015     812
10  Royals     1  2015     804

In [90]:
df.query('Year==2015')

      Team  Rank  Year  Points
1       MI     2  2015     789
3   Devils     3  2015     673
5      CSK     4  2015     812
10  Royals     1  2015     804

In [91]:
df[df.loc[:,'Year']==2015]

      Team  Rank  Year  Points
1       MI     2  2015     789
3   Devils     3  2015     673
5      CSK     4  2015     812
10  Royals     1  2015     804

In [92]:
grouped = df.groupby('Year')
grouped.get_group(2015)

      Team  Rank  Year  Points
1       MI     2  2015     789
3   Devils     3  2015     673
5      CSK     4  2015     812
10  Royals     1  2015     804

In [93]:
#Selecting a perticular group
grouped = df.groupby('Team')
grouped.get_group('MI')

   Team  Rank  Year  Points
0    MI     1  2014     876
1    MI     2  2015     789
8    MI     2  2016     694
11   MI     2  2017     690

In [94]:
#wantto fetch the data of year =2014
list(df.groupby('Year'))[0]

(2014,
      Team  Rank  Year  Points
 0      MI     1  2014     876
 2  Devils     2  2014     863
 4   Kings     3  2014     741
 9  Royals     4  2014     701)

In [95]:
#i want record of year 2017
df.groupby('Year').get_group(2017)

   Team  Rank  Year  Points
7   CSK     1  2017     788
11   MI     2  2017     690

In [96]:
# i want the team who stood 1st max times in ipl
df.groupby('Rank').get_group(1)

      Team  Rank  Year  Points
0       MI     1  2014     876
6      CSK     1  2016     756
7      CSK     1  2017     788
10  Royals     1  2015     804

In [97]:
df.groupby('Rank').get_group(1)['Team'].value_counts()

CSK       2
Royals    1
MI        1
Name: Team, dtype: int64

In [98]:
df["Team"].value_counts()

MI        4
CSK       3
Royals    2
Devils    2
Kings     1
Name: Team, dtype: int64

In [99]:
#Aggregations #sum mean median mode std
#Aggregations work only on Numeric fields
import numpy as np
grouped = df.groupby('Year')
grouped['Points'].agg(np.sum)

Year
2014    3181
2015    3078
2016    1450
2017    1478
Name: Points, dtype: int64

In [100]:
grouped = df.groupby('Team')
grouped.agg(np.size) #here size is nothing but occurance

        Rank  Year  Points
Team
CSK        3     3       3
Devils     2     2       2
Kings      1     1       1
MI         4     4       4
Royals     2     2       2

In [101]:
df.Team.value_counts()

MI        4
CSK       3
Royals    2
Devils    2
Kings     1
Name: Team, dtype: int64

In [102]:
df['Team'].value_counts()

MI        4
CSK       3
Royals    2
Devils    2
Kings     1
Name: Team, dtype: int64

In [103]:
#Applying Multiple Aggregation Functions at Once
grouped = df.groupby('Team')
grouped['Points'].agg([np.sum, np.mean, np.std])

         sum        mean         std
Team
CSK     2356  785.333333   28.095077
Devils  1536  768.000000  134.350288
Kings    741  741.000000         NaN
MI      3049  762.250000   88.567771
Royals  1505  752.500000   72.831998

In [104]:
#Transformation calling a function over the selected data
grouped = df.groupby('Team')
score = lambda x: (x + 500)
grouped['Points'].transform(score)

0     1376
1     1289
2     1363
3     1173
4     1241
5     1312
6     1256
7     1288
8     1194
9     1201
10    1304
11    1190
Name: Points, dtype: int64

In [105]:
#list(df.groupby('Team')['Points'])
df.groupby('Team')['Points'].transform(lambda x:x+100)

0     976
1     889
2     963
3     773
4     841
5     912
6     856
7     888
8     794
9     801
10    904
11    790
Name: Points, dtype: int64

In [106]:
list(df.groupby('Team')['Points'])

[('CSK',
  5    812
  6    756
  7    788
  Name: Points, dtype: int64),
 ('Devils',
  2    863
  3    673
  Name: Points, dtype: int64),
 ('Kings',
  4    741
  Name: Points, dtype: int64),
 ('MI',
  0     876
  1     789
  8     694
  11    690
  Name: Points, dtype: int64),
 ('Royals',
  9     701
  10    804
  Name: Points, dtype: int64)]

In [107]:
list(df.groupby('Team')['Points'])

[('CSK',
  5    812
  6    756
  7    788
  Name: Points, dtype: int64),
 ('Devils',
  2    863
  3    673
  Name: Points, dtype: int64),
 ('Kings',
  4    741
  Name: Points, dtype: int64),
 ('MI',
  0     876
  1     789
  8     694
  11    690
  Name: Points, dtype: int64),
 ('Royals',
  9     701
  10    804
  Name: Points, dtype: int64)]

In [108]:
# I wantto give the +10 exxtra points to csk use transform
df.groupby('Team').get_group('CSK')['Points'].transform(lambda x:x+10)

5    822
6    766
7    798
Name: Points, dtype: int64

In [109]:
df

      Team  Rank  Year  Points
0       MI     1  2014     876
1       MI     2  2015     789
2   Devils     2  2014     863
3   Devils     3  2015     673
4    Kings     3  2014     741
5      CSK     4  2015     812
6      CSK     1  2016     756
7      CSK     1  2017     788
8       MI     2  2016     694
9   Royals     4  2014     701
10  Royals     1  2015     804
11      MI     2  2017     690

In [110]:
 #I want to give extra +10 point only to the teams from year 2015
df.groupby('Year').get_group(2015)['Points'].transform(lambda x:x+10)

1     799
3     683
5     822
10    814
Name: Points, dtype: int64